title: Office Spawns PowerShell With Network Ops
status: experimental
logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    EventID: 1
    ParentImage|endswith:
      - "\\WINWORD.EXE"
      - "\\EXCEL.EXE"
    Image|endswith: "\\powershell.exe"
    CommandLine|contains:
      - "IEX"
      - "FromBase64String"
      - "Invoke-WebRequest"
  condition: selection

level: high
tags:
  - attack.t1059.001
  - attack.t1566